			  
#Область Задачка1
			  
&НаКлиенте
Процедура Задачка1_КоличествоВетокНаДереве_Команда(Команда)
	Задачка1_КоличествоВетокНаДереве();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Задачка1_КоличествоВетокНаДереве()
	
	КоличествоВетокНаДереве = 0;
	
	ДеревоВеток = Новый ДеревоЗначений();
	Ветка0 = ДеревоВеток.Строки.Добавить();
	Ветка1 = Ветка0.Строки.Добавить();
	Ветка2 = Ветка1.Строки.Добавить();
	Ветка3 = Ветка1.Строки.Добавить();
	Ветка2.Строки.Добавить();
	Ветка3.Строки.Добавить();
	
	КоличествоВетокНаВетке(Ветка0, КоличествоВетокНаДереве);
	
	Сообщить(КоличествоВетокНаДереве);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КоличествоВетокНаВетке(Знач ВеткаДерева, Знач КоличествоВеток)
	
	КоличествоВеток = КоличествоВеток + ВеткаДерева.Строки.Количество();
	
	Для Каждого ВеткаДерева Из ВеткаДерева.Строки Цикл
		КоличествоВетокНаВетке(ВеткаДерева, КоличествоВеток);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область Задачка2

&НаКлиенте
Процедура Задачка2_ОбещаниеЖдать_Команда(Команда)

	Задачка2_ПриключенияМариныИВани();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Задачка2_ПриключенияМариныИВани()
	
	СостояниеМарины	= "Дома";
	СостояниеВани	= "Дома";
	
	ОбещаниеЖдатьВаню 	= ВаняПошелВМагазин(Истина);
	СостояниеВани 		= Ждать ОбещаниеЖдатьВаню;
	
	Если СостояниеВани = "Пойду в гараж" Тогда
		СостояниеМарины	= "Пойду искать Ваню";
	Иначе
		СостояниеМарины	= "Дома";
	КонецЕсли;	
	
	Попытка
		ОбещаниеВернутьсяДомой 	= ПойдуИскатьВаню();
		СостояниеМарины			= Ждать ОбещаниеВернутьсяДомой;
	Исключение
		СостояниеМарины			= "Дома"
	КонецПопытки;	
	
	Сообщить("" + СостояниеМарины + " " + СостояниеВани);
	
КонецПроцедуры

&НаКлиенте
Асинх Функция ВаняПошелВМагазин(Знач БудуЖдатьВаню)
	
	Если БудуЖдатьВаню Тогда
		СостояниеВани = "Дома";
	Иначе
		СостояниеВани = "Пойду в гараж";
	КонецЕсли;	
	
	Возврат СостояниеВани;
	
КонецФункции

&НаКлиенте
Асинх Функция ПойдуИскатьВаню()
	
	СостояниеМарины = "Нашла Ваню";
	
	ВызватьИсключение СостояниеМарины;
	
	Возврат "Ищу Ваню";
	
КонецФункции

#КонецОбласти

#Область Задачка3

&НаКлиенте
Процедура Задачка3_Потоки_Команда(Команда)
	
	Задачка3_ДанныеВПамяти();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Задачка3_ДанныеВПамяти() 
		
	ДвоичныеДанныеСтроки	= ПолучитьДвоичныеДанныеИзHexСтроки("66 72 69 64 61 79");
	ЧтениеСтроки			= Новый ЧтениеДанных(ДвоичныеДанныеСтроки);
	ИсходнаяСтрока			= ЧтениеСтроки.ПрочитатьСтроку();

	ОбработаннаяСтрока		= СтрЗаменитьПоРегулярномуВыражению(ИсходнаяСтрока,"i|r|f","");
	ФинальнаяСтрока			= СтрЗаменить(ИсходнаяСтрока, ОбработаннаяСтрока, ""); 
	
	Сообщить("" + ИсходнаяСтрока + " " + ОбработаннаяСтрока + " " + ФинальнаяСтрока);
	
КонецПроцедуры

//ПотокДляЧтенияСтроки	= ДвоичныеДанныеСтроки.ОткрытьПотокДляЧтения();
//ЧтениеСтроки			= Новый ЧтениеДанных(ПотокДляЧтенияСтроки);
//ИсходнаяСтрока			= ЧтениеСтроки.ПрочитатьСтроку();

#КонецОбласти

#Область Задачка4

&НаКлиенте
Процедура Задачка4_Транзакции_Команда(Команда)
	
	ЗаписатьДанныеВСистему();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеВСистему()
	
	СтрокаСообщения = "";
	
	ЗаписатьГлавноеЧисло(42, СтрокаСообщения);
	ДобавитьВСтрокуГлавноеЧисло(СтрокаСообщения);
	
	Сообщить(СтрокаСообщения);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьГлавноеЧисло(ЧислоДляЗаписи, СтрокаСообщения)
	
	ЗаписатьГлавноеЧислоВТранзакции(ЧислоДляЗаписи, СтрокаСообщения);
	ДобавитьВСтрокуГлавноеЧисло(СтрокаСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьГлавноеЧислоВТранзакции(ЧислоДляЗаписи, СтрокаСообщения)
	
	НачатьТранзакцию();
	Попытка
		Константы.ГлавноеЧисло.Установить(ЧислоДляЗаписи);
		ДобавитьВСтрокуГлавноеЧисло(СтрокаСообщения);
		//ЗафиксироватьТранзакцию(); Забыли зафиксировать
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ДобавитьВСтрокуГлавноеЧисло(СтрокаСообщения);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьВСтрокуГлавноеЧисло(СтрокаПриемник)
	СтрокаПриемник = "" + СтрокаПриемник + " " + Константы.ГлавноеЧисло.Получить();
КонецПроцедуры

#КонецОбласти

#Область Задачка5

&НаКлиенте
Процедура Задачка5_Запрос_Команда(Команда)
	
	Задачка5_Запрос();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Задачка5_Запрос()
	
    ЗапросНумерация 		= Новый Запрос();
	ЗапросНумерация.Текст 	= "ВЫБРАТЬ ПЕРВЫЕ 3
	                      	  |	1 КАК НомерПоПорядку,
	                      	  |	Города.Наименование КАК НазваниеГорода,
	                      	  |	Города.Ссылка КАК Ссылка
	                      	  |ПОМЕСТИТЬ ВТ_Города
	                      	  |ИЗ
	                      	  |	Справочник.Города КАК Города
	                      	  |
	                      	  |УПОРЯДОЧИТЬ ПО
	                      	  |	Ссылка
	                      	  |;
	                      	  |
	                      	  |////////////////////////////////////////////////////////////////////////////////
	                      	  |ВЫБРАТЬ
	                      	  |	МАКСИМУМ(ТаблицаНомеровСущностей.КолонкаНомер1) КАК КолонкаНомер1,
	                      	  |	МАКСИМУМ(ТаблицаНомеровСущностей.КолонкаНомер2) КАК КолонкаНомер2,
	                      	  |	МАКСИМУМ(ТаблицаНомеровСущностей.КолонкаНомер3) КАК КолонкаНомер3
	                      	  |ИЗ
	                      	  |	(ВЫБРАТЬ
	                      	  |		ВЫБОР
	                      	  |			КОГДА СУММА(ВТ_Города_Левая.НомерПоПорядку) = 1
	                      	  |				ТОГДА 1
	                      	  |			ИНАЧЕ NULL
	                      	  |		КОНЕЦ КАК КолонкаНомер1,
	                      	  |		ВЫБОР
	                      	  |			КОГДА СУММА(ВТ_Города_Левая.НомерПоПорядку) = 2
	                      	  |				ТОГДА 2
	                      	  |			ИНАЧЕ NULL
	                      	  |		КОНЕЦ КАК КолонкаНомер2,
	                      	  |		ВЫБОР
	                      	  |			КОГДА СУММА(ВТ_Города_Левая.НомерПоПорядку) = 3
	                      	  |				ТОГДА 3
	                      	  |			ИНАЧЕ NULL
	                      	  |		КОНЕЦ КАК КолонкаНомер3
	                      	  |	ИЗ
	                      	  |		ВТ_Города КАК ВТ_Города_Левая
	                      	  |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Города КАК ВТ_Города_Правая
	                      	  |			ПО ВТ_Города_Левая.Ссылка >= ВТ_Города_Правая.Ссылка
	                      	  |	
	                      	  |	СГРУППИРОВАТЬ ПО
	                      	  |		ВТ_Города_Левая.НазваниеГорода) КАК ТаблицаНомеровСущностей
	                      	  |;
	                      	  |
	                      	  |////////////////////////////////////////////////////////////////////////////////
	                      	  |УНИЧТОЖИТЬ ВТ_Города";
				   
	ЗапросНумерация.Текст 	= "ВЫБРАТЬ ПЕРВЫЕ 3
	                      	  |	1 КАК НомерПоПорядку,
	                      	  |	Города.Наименование КАК НазваниеГорода,
	                      	  |	Города.Ссылка КАК Ссылка
	                      	  |ПОМЕСТИТЬ ВТ_Города
	                      	  |ИЗ
	                      	  |	Справочник.Города КАК Города
	                      	  |
	                      	  |УПОРЯДОЧИТЬ ПО
	                      	  |	Ссылка
	                      	  |;
	                      	  |
	                      	  |////////////////////////////////////////////////////////////////////////////////
	                      	  |ВЫБРАТЬ
	                      	  |	СУММА(ВТ_Города_Левая.НомерПоПорядку) КАК НомерПоПорядку
	                      	  |ИЗ
	                      	  |	ВТ_Города КАК ВТ_Города_Левая
	                      	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Города КАК ВТ_Города_Правая
	                      	  |		ПО ВТ_Города_Левая.Ссылка <= ВТ_Города_Правая.Ссылка
	                      	  |
	                      	  |СГРУППИРОВАТЬ ПО
	                      	  |	ВТ_Города_Левая.НазваниеГорода
	                      	  |
	                      	  |УПОРЯДОЧИТЬ ПО
	                      	  |	НомерПоПорядку УБЫВ
	                      	  |;
	                      	  |
	                      	  |////////////////////////////////////////////////////////////////////////////////
	                      	  |УНИЧТОЖИТЬ ВТ_Города";
				   
	ЗапросНумерация.Текст 	= "ВЫБРАТЬ ПЕРВЫЕ 3
	                      	  |	1 КАК НомерПоПорядку,
	                      	  |	Города.Наименование КАК НазваниеГорода,
	                      	  |	Города.Ссылка КАК Ссылка
	                      	  |ПОМЕСТИТЬ ВТ_Города
	                      	  |ИЗ
	                      	  |	Справочник.Города КАК Города
	                      	  |;
	                      	  |
	                      	  |////////////////////////////////////////////////////////////////////////////////
	                      	  |ВЫБРАТЬ
	                      	  |	СУММА(ВТ_Города_Левая.НомерПоПорядку) КАК НомерПоПорядку
	                      	  |ИЗ
	                      	  |	ВТ_Города КАК ВТ_Города_Левая
	                      	  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Города КАК ВТ_Города_Правая
	                      	  |		ПО ВТ_Города_Левая.Ссылка <= ВТ_Города_Правая.Ссылка
	                      	  |
	                      	  |СГРУППИРОВАТЬ ПО
	                      	  |	ВТ_Города_Левая.НазваниеГорода
	                      	  |
	                      	  |УПОРЯДОЧИТЬ ПО
	                      	  |	НомерПоПорядку УБЫВ
	                      	  |;
	                      	  |
	                      	  |////////////////////////////////////////////////////////////////////////////////
	                      	  |УНИЧТОЖИТЬ ВТ_Города";				   
	
КонецПроцедуры

#КонецОбласти

